###################################################################

# Created by write_sdc on Tue Feb 28 14:51:16 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_delay 25  -to [get_ports {op[6]}]
set_max_delay 25  -to [get_ports {op[5]}]
set_max_delay 25  -to [get_ports {op[4]}]
set_max_delay 25  -to [get_ports {op[3]}]
set_max_delay 25  -to [get_ports {op[2]}]
set_max_delay 25  -to [get_ports {op[1]}]
set_max_delay 25  -to [get_ports {op[0]}]
set_load 0.000421803  [get_nets n24]
set_load 0.00099253  [get_nets n23]
set_load 0.00336939  [get_nets n11]
set_load 0.00127663  [get_nets n8]
set_load 0.000819694  [get_nets n7]
set_load 0.00246934  [get_nets n18]
set_load 0.000546797  [get_nets n21]
set_load 0.000801749  [get_nets n22]
set_load 0.000291693  [get_nets n20]
set_load 0.000813649  [get_nets n2]
set_load 0.00062985  [get_nets n19]
set_load 0.0011258  [get_nets n15]
set_load 0.00118452  [get_nets n16]
set_load 0.001687  [get_nets n6]
set_load 0.000375287  [get_nets n17]
set_load 0.000589222  [get_nets n14]
set_load 0.000497778  [get_nets n12]
set_load 0.00105537  [get_nets n13]
set_load 0.00107907  [get_nets n10]
set_load 0.000434517  [get_nets n5]
set_load 0.00116753  [get_nets n9]
set_load 0.000346493  [get_nets n1]
set_load 0.00318551  [get_nets {op[6]}]
set_load 0.0029093  [get_nets {op[5]}]
set_load 0.00218123  [get_nets {op[4]}]
set_load 0.000790309  [get_nets {op[3]}]
set_load 0.00258822  [get_nets {op[2]}]
set_load 0.00273786  [get_nets {op[1]}]
set_load 0.000895722  [get_nets {op[0]}]
set_load 0.00174362  [get_nets {funct[5]}]
set_load 0.00200963  [get_nets {funct[4]}]
set_load 0.00299281  [get_nets {funct[3]}]
set_load 0.00498731  [get_nets {funct[2]}]
set_load 0.00588355  [get_nets {funct[1]}]
set_load 0.00452775  [get_nets {funct[0]}]
set_load 0.00442761  [get_nets {alu_op[1]}]
set_load 0.00342817  [get_nets {alu_op[0]}]
